<?php

return [
    'base' => '/utes/',
    'name' => '广西师范大学教师教学测评系统',
    'slug' => '教学测评系统',
    'keywords' => 'Laravel, Bootstrap, Admin template',
    'description' => 'An admin boilerplate developed with Bootstrap and AdminLTE base on Laravel',
    'author' => 'Fu Rongxin',
    'powerby' => 'Fu Rongxin',
    'copyright' => '广西师范大学教师教学发展中心',
    'password' => '123456',

    // 状态代码,
    'code' => [
        100001 => '对象正在更新',

        200001 => '对象创建成功',
        200002 => '对象更新成功',
        200003 => '对象删除成功',
        200004 => '登录成功',
        200005 => '登出成功',
        200006 => '修改密码成功',
        200007 => '重置密码成功',
        200008 => '文件上传成功',
        200009 => '数据导入成功',
        200010 => '数据导出成功',
        200011 => '教师抽签成功',

        401001 => '用户未认证',
        401002 => '账户已锁定',
        401003 => '用户未启用',
        402001 => '系统已关闭',
        403001 => '重置密码失败',
        403002 => '修改密码失败',
        403003 => '旧密码错误, 请重新输入',
        403004 => '确认密码与新密码不一致, 请重新输入',
        405001 => '提交方法错误',

        500001 => '对象创建失败',
        500002 => '对象更新失败',
        500003 => '对象删除失败',
        500004 => '对象不存在',
        500005 => '角色分配失败',
        500006 => '权限分配失败',
        500007 => '上传文件不合法',
        500008 => '文件上传失败',
    ],
];
